In [1]:
import configparser
import psycopg2
%load_ext sql

In [6]:
config = configparser.ConfigParser()
config.read('dwh.cfg')
HOST=config.get('CLUSTER','HOST')
DB_USER=config.get('CLUSTER','DB_USER')
DB_PASSWORD=config.get('CLUSTER','DB_PASSWORD')
DB_PORT=config.get('CLUSTER','DB_PORT')
DB_NAME=config.get('CLUSTER','DB_NAME')

In [7]:
conn_string="postgresql://{}:{}@{}:{}/{}".format(DB_USER,DB_PASSWORD,HOST,DB_PORT,DB_NAME)
%sql $conn_string

'Connected: awsuser@dev'

In [8]:
%sql SELECT * FROM songs LIMIT 5

 * postgresql://awsuser:***@redshift-cluster.ccyzenhev7c2.us-east-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[('SOCIWDW12A8C13D406', 'Soul Deep', 'ARMJAGH1187FB546F3', 1969, 148),
 ('SOHKNRJ12A6701D1F8', 'Drop of Rain', 'AR10USD1187B99F3F1', 0, 189),
 ('SOFSOCN12A8C143F5D', 'Face the Ashes', 'ARXR32B1187FB57099', 2007, 209),
 ('SOFRDWL12A58A7CEF7', 'Hit Da Scene', 'AR9Q9YC1187FB5609B', 0, 252),
 ('SONQPZK12AB0182D84', 'Double Wide', 'ARKYKXP11F50C47A6A', 0, 160)]

In [9]:
%sql SELECT * FROM users LIMIT 5

 * postgresql://awsuser:***@redshift-cluster.ccyzenhev7c2.us-east-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[(7, 'Adelyn', 'Jordan', 'F', 'free'),
 (18, 'Jacob', 'Rogers', 'M', 'free'),
 (37, 'Jordan', 'Hicks', 'F', 'free'),
 (54, 'Kaleb', 'Cook', 'M', 'free'),
 (63, 'Ayla', 'Johnson', 'F', 'free')]

In [10]:
%sql SELECT * FROM songplays LIMIT 5

 * postgresql://awsuser:***@redshift-cluster.ccyzenhev7c2.us-east-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[(192, datetime.datetime(2018, 11, 2, 3, 5, 57, 796000), 48, 'free', None, None, 47, 'Salinas, CA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (624, datetime.datetime(2018, 11, 2, 12, 2, 41, 796000), 49, 'free', None, None, 179, 'San Francisco-Oakland-Hayward, CA', 'Mozilla/5.0 (Windows NT 5.1; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (640, datetime.datetime(2018, 11, 2, 12, 9, 30, 796000), 49, 'free', None, None, 179, 'San Francisco-Oakland-Hayward, CA', 'Mozilla/5.0 (Windows NT 5.1; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (816, datetime.datetime(2018, 11, 2, 15, 40, 21, 796000), 61, 'free', None, None, 60, 'Houston-The Woodlands-Sugar Land, TX', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.77.4 (KHTML, like Gecko) Version/7.0.5 Safari/537.77.4"'),
 (820, datetime.datetime(2018, 11, 2, 15, 43, 16, 796000), 61, 'free', None, None, 60, 'Houston-The Woodlands-Sugar Land, TX', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.77.4 (KHTML, like Gecko) Version/7.0.5 Safari/537.77.4"')]

In [11]:
%sql SELECT * FROM artists LIMIT 5

 * postgresql://awsuser:***@redshift-cluster.ccyzenhev7c2.us-east-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[('ARMJAGH1187FB546F3', 'The Box Tops', 'Memphis, TN', 35.14968, -90.04892),
 ('AR10USD1187B99F3F1', 'Tweeterfriendly Music', 'Burlington, Ontario, Canada', None, None),
 ('ARXR32B1187FB57099', 'Gob', '', None, None),
 ('AR9Q9YC1187FB5609B', 'Quest_ Pup_ Kevo', 'New Jersey', None, None),
 ('ARKYKXP11F50C47A6A', 'The Supersuckers', '', None, None)]

In [12]:
%sql SELECT * FROM time LIMIT 5

 * postgresql://awsuser:***@redshift-cluster.ccyzenhev7c2.us-east-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[(datetime.datetime(2018, 11, 3, 1, 5, 50, 796000), 1, 3, 44, 11, 2018, 6),
 (datetime.datetime(2018, 11, 3, 14, 17, 50, 796000), 14, 3, 44, 11, 2018, 6),
 (datetime.datetime(2018, 11, 3, 15, 54, 48, 796000), 15, 3, 44, 11, 2018, 6),
 (datetime.datetime(2018, 11, 3, 16, 10, 32, 796000), 16, 3, 44, 11, 2018, 6),
 (datetime.datetime(2018, 11, 3, 16, 29, 46, 796000), 16, 3, 44, 11, 2018, 6)]